---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures
source: html/e5050968-a581-aed7-0ed5-f14f898c1305.htm
---
# BuiltInFailures.EnergyAnalysisFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.